In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
input=df.drop('Survived',axis='columns')
target=df.Survived

In [5]:
dummies=pd.get_dummies(input.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
input=pd.concat([input,dummies],axis='columns')
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
input.drop(['Sex','male'],axis='columns',inplace=True)
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [8]:
input.isnull().any()

Pclass    False
Age        True
Fare      False
female    False
dtype: bool

In [9]:
input.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
dtype: int64

In [10]:
input.Age=input.Age.fillna(input.Age.mean())
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(input,target,test_size=0.2)

In [12]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(x_train,y_train)

GaussianNB()

In [14]:
model.score(x_test,y_test)

0.7430167597765364

In [15]:
x_test[0:10]

     Pclass        Age      Fare  female
141       3  22.000000    7.7500       1
411       3  29.699118    6.8583       0
725       3  20.000000    8.6625       0
112       3  22.000000    8.0500       0
870       3  26.000000    7.8958       0
489       3   9.000000   15.9000       0
527       1  29.699118  221.7792       0
682       3  20.000000    9.2250       0
176       3  29.699118   25.4667       0
209       1  40.000000   31.0000       0

In [16]:
model.predict(x_test[0:10])

array([1, 0, 0, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [17]:
model.predict_proba(x_test[:10])

array([[3.84896681e-01, 6.15103319e-01],
       [9.71851600e-01, 2.81483999e-02],
       [9.67507653e-01, 3.24923466e-02],
       [9.68673160e-01, 3.13268400e-02],
       [9.70684590e-01, 2.93154102e-02],
       [9.57089864e-01, 4.29101360e-02],
       [1.73356944e-08, 9.99999983e-01],
       [9.67598794e-01, 3.24012064e-02],
       [9.71167556e-01, 2.88324442e-02],
       [7.93099874e-01, 2.06900126e-01]])

In [18]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),x_train, y_train, cv=5)

array([0.74825175, 0.8041958 , 0.73239437, 0.82394366, 0.82394366])